//=============================================================================
//
// ロボットクラス [RobotActor.cpp]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#include "RobotActor.h"
#include "../../Framework/Resource/ResourceManager.h"

//=====================================
// コンストラクタ
//=====================================
RobotActor::RobotActor(const D3DXVECTOR3& Pos) :
	PlaceActor(Pos)
{

}

//=====================================
// デストラクタ
//=====================================
RobotActor::~RobotActor()
{

}
