//=============================================================================
//
// サーバービューアコンフィグクラス [ViewerConfig.h]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#ifndef _ViewerConfig_H_
#define _ViewerConfig_H_

namespace Viewer
{
	// X(10.264f),Y(5.773f)はカメラのNearZが10.0fの場合、ちょうど背景が全画面表示できるサイズ
	static D3DXVECTOR2 BackGroundSize = D3DXVECTOR2(10.264f * 10, 5.773f * 10);
	// Z値はNearZの10倍だから、サイズは10倍かける
	static D3DXVECTOR3 BackgroundPos = D3DXVECTOR3(0.0f, 10.0f, 100.0f);

	enum State
	{
		Ranking,
		EventLive,
		//LevelUp,
		Max,
	};
}

//*****************************************************************************
// クラス定義
//*****************************************************************************


#endif