//=============================================================================
//
// サウンドコンフィグクラス [SoundConfig.h]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#ifndef _SOUNDCONFIG_H_
#define _SOUNDCONFIG_H_

/**************************************
前方宣言
***************************************/

/**************************************
クラス定義
***************************************/
class SoundConfig
{
public:
	// SEの通し番号
	enum SEID
	{
		// *** SE ***
		RankingInsert,		// ランキング追加
		PlusEvent,			// プラスイベント
		MinusEvent,			// マイナスイベント
		Clapping,			// 拍手
		FieldLevelUp,		// フィールドレベルアップ
		Transition,			// シーン遷移
		SEMax
	};

	//音声ファイルのパス
	const static char* SEPath[SEID::SEMax];
};

#endif